### 1. Descriptive Statistics for Pandas DataFrame

In [27]:
import pandas as pd
import numpy as np

In [35]:
data = {'name':pd.Series(['prakash','rakesh','manoj','pravin','karan']),'Age':pd.Series([25,26,27,28,29,]),'Rating':pd.Series([4.23,2.35,1.56,3.20,4.62])}
df =pd.DataFrame(data)
df

      name  Age  Rating
0  prakash   25    4.23
1   rakesh   26    2.35
2    manoj   27    1.56
3   pravin   28    3.20
4    karan   29    4.62

#### Fet the descriptive statistics for a specific column in your DataFrame:
* df[‘DataFrame Column’].describe(

#### Descriptive Statistics for Categorical Data

In [41]:
df['name'].describe()

count           5
unique          5
top       prakash
freq            1
Name: name, dtype: object

In [45]:
df['Age'].describe()

count     5.000000
mean     27.000000
std       1.581139
min      25.000000
25%      26.000000
50%      27.000000
75%      28.000000
max      29.000000
Name: Age, dtype: float64

In [51]:
df['Rating'].describe()

count    5.000000
mean     3.192000
std      1.273684
min      1.560000
25%      2.350000
50%      3.200000
75%      4.230000
max      4.620000
Name: Rating, dtype: float64

In [55]:
df.describe()

             Age    Rating
count   5.000000  5.000000
mean   27.000000  3.192000
std     1.581139  1.273684
min    25.000000  1.560000
25%    26.000000  2.350000
50%    27.000000  3.200000
75%    28.000000  4.230000
max    29.000000  4.620000

#### Get the Descriptive Statistics for the Entire Pandas DataFrame

In [63]:
df.describe(include='all')

           name        Age    Rating
count         5   5.000000  5.000000
unique        5        NaN       NaN
top     prakash        NaN       NaN
freq          1        NaN       NaN
mean        NaN  27.000000  3.192000
std         NaN   1.581139  1.273684
min         NaN  25.000000  1.560000
25%         NaN  26.000000  2.350000
50%         NaN  27.000000  3.200000
75%         NaN  28.000000  4.230000
max         NaN  29.000000  4.620000

#### Breaking Down the Descriptive Statistics
#### Sum Entire Data Frame

In [67]:
df.sum()

name      prakashrakeshmanojpravinkaran
Age                                 135
Rating                            15.96
dtype: object

#### Sum of all the Age

In [80]:
print('sum of Age:' , df.Age.sum())

sum of Age: 135

#### Count

In [87]:
print('count no of Age :',df.Age.count())

count no of Age : 5

#### Mean

In [90]:
print('Mean of Age:', df.Age.mean())

Mean of Age: 27.0

#### Standard Deviation

In [93]:
print('std. of Age:', df.Age.std())

std. of Age: 1.5811388300841898

#### Minimum

In [96]:
print('min. of Age ', df.Age.min())

min. of Age  25

#### 0.25 Quantile

In [102]:
print("0.25 Quantile:",df['Age'].quantile(q=0.25))

0.25 Quantile: 26.0

#### 0.50 Quantile (Median):

In [105]:
print("0.50 Quantile Median:",df['Age'].quantile(q=0.50))

0.50 Quantile Median: 27.0

#### 0.75 Quantile:

In [108]:
print("0.75 Quantile:",df['Age'].quantile(q=0.75))

0.75 Quantile: 28.0

#### Maximum:

In [111]:
print("Maximum Age:",df.Age.max())

Maximum Age: 29

#### Product:

In [114]:
print("Product of Age:",df.Age.prod())

Product of Age: 14250600

#### Median:

In [117]:
print("Median of Age:",df.Age.median())

Median of Age: 27.0

#### Cumulative Sum:

In [131]:
print("Cumsum of Age:",df.Age.cumsum())

Cumsum of Age: 0     25
1     51
2     78
3    106
4    135
Name: Age, dtype: int64

#### Cumulative Product:

In [134]:
print("Cumprod of Age:",df.Age.cumprod())

Cumprod of Age: 0          25
1         650
2       17550
3      491400
4    14250600
Name: Age, dtype: int64

#### Mode:

In [137]:
print("Mode:",df.Age.mode())

Mode: 0    25
1    26
2    27
3    28
4    29
Name: Age, dtype: int64

#### Absolute Value

In [140]:
print("Absolute Value:",df.Age.abs())

Absolute Value: 0    25
1    26
2    27
3    28
4    29
Name: Age, dtype: int64

#### 2. Pandas – Basic Functionality
* axes: Returns a list of the row axis labels
* dtype: Returns the dtype of the object.
* empty: Returns True if series is empty.
* ndim: Returns the number of dimensions of the underlying data, by definition 1.
* size: Returns the number of elements in the underlying data.
* values: Returns the Series as ndarray.
* head(): Returns the first n rows.
* tail(): Returns the last n rows.

#### Axes

In [147]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['name', 'Age', 'Rating'], dtype='object')]

#### dtype

In [150]:
df['Age'].dtype

dtype('int64')

#### empty

In [160]:
df.empty

False

#### ndim

In [163]:
df.ndim

2

#### size

In [166]:
df.size

15

#### values

In [169]:
df.values

array([['prakash', 25, 4.23],
       ['rakesh', 26, 2.35],
       ['manoj', 27, 1.56],
       ['pravin', 28, 3.2],
       ['karan', 29, 4.62]], dtype=object)

#### head()

In [184]:
df.head()

      name  Age  Rating
0  prakash   25    4.23
1   rakesh   26    2.35
2    manoj   27    1.56
3   pravin   28    3.20
4    karan   29    4.62

In [186]:
df.head(2)

      name  Age  Rating
0  prakash   25    4.23
1   rakesh   26    2.35

#### tail()

In [189]:
df.tail()

      name  Age  Rating
0  prakash   25    4.23
1   rakesh   26    2.35
2    manoj   27    1.56
3   pravin   28    3.20
4    karan   29    4.62

In [191]:
df.tail(2)

     name  Age  Rating
3  pravin   28    3.20
4   karan   29    4.62